# 所有渔船在2020年一整年的数据条目，曲线的变化趋势反应出捕鱼期的旺季和旱季
import matplotlib.pyplot as plt
from icecream import ic

if __name__ == "__main__":
    dict1 = {'01': 278522,
             '02': 222710,
             '03': 771364,
             '04': 823198,
             '05': 46407,
             '06': 33379,
             '07': 42087,
             '08': 814868,
             '09': 917286,
             '10': 530045,
             '11': 9745}
    dict2 = {'01': 266123,
             '02': 220234,
             '03': 406223,
             '04': 286508,
             '05': 15370,
             '06': 9417,
             '07': 11850,
             '08': 298239,
             '09': 392929,
             '10': 315885,
             '11': 15904}
    dict3 = {'01': 278963,
             '02': 269220,
             '03': 418326,
             '04': 364487,
             '05': 200271,
             '06': 174604,
             '07': 170081,
             '08': 410087,
             '09': 472099,
             '10': 399132,
             '11': 14536}
    plt.plot([i for i in range(1, 12)], [dict1[key] for key in dict1], color='r')
    plt.plot([i for i in range(1, 12)], [dict2[key] for key in dict2], color='g')
    plt.plot([i for i in range(1, 12)], [dict3[key] for key in dict3], color='b')
    plt.show()
